<a href="https://colab.research.google.com/github/a-dhingra/ECommerceWebScraper/blob/master/Merge.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [109]:
import pandas as pd
import numpy as np

In [110]:
# CREATE 2 DATAFRAMES
df1 = pd.DataFrame(np.random.randn(5,4), columns=list('ABCD'))
df1 = df1*100000
pd.options.display.max_colwidth = 200
pd.options.display.float_format = '{:.2f}'.format
df1['A'] = df1['A']*10
df1.head()

            A         B         C          D
0  -462579.48  54038.37  32893.01 -119750.65
1 -1594666.56 165304.54 122398.27  202241.47
2  1673215.67 -83728.35 132489.21 -138557.60
3  -620661.01  46883.16  52884.31  111034.40
4   278619.15 -11921.33 102636.11  -66806.76

In [111]:
df1.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [112]:
df1['A'] = df1['A'].apply(lambda x:x*(-1) if x < 0.0 else x)
df1.head()

           A         B         C          D
0  462579.48  54038.37  32893.01 -119750.65
1 1594666.56 165304.54 122398.27  202241.47
2 1673215.67 -83728.35 132489.21 -138557.60
3  620661.01  46883.16  52884.31  111034.40
4  278619.15 -11921.33 102636.11  -66806.76

In [113]:
df1['A'] = ['CAT','BAT','RAT','DOG','COW']
df1

     A         B         C          D
0  CAT  54038.37  32893.01 -119750.65
1  BAT 165304.54 122398.27  202241.47
2  RAT -83728.35 132489.21 -138557.60
3  DOG  46883.16  52884.31  111034.40
4  COW -11921.33 102636.11  -66806.76

In [114]:
df1.set_index('A')

            B         C          D
A
CAT  54038.37  32893.01 -119750.65
BAT 165304.54 122398.27  202241.47
RAT -83728.35 132489.21 -138557.60
DOG  46883.16  52884.31  111034.40
COW -11921.33 102636.11  -66806.76

In [115]:
df1['B'] = np.random.randint(10,99,5)
df1

     A   B         C          D
0  CAT  60  32893.01 -119750.65
1  BAT  37 122398.27  202241.47
2  RAT  88 132489.21 -138557.60
3  DOG  86  52884.31  111034.40
4  COW  25 102636.11  -66806.76

In [116]:
df1['C'] = np.random.randint(100,999,5)
df1['D'] = np.random.randint(1,9,5)
df1

     A   B    C  D
0  CAT  60  903  3
1  BAT  37  742  1
2  RAT  88  880  7
3  DOG  86  247  6
4  COW  25  180  3

In [117]:
df1 = df1.set_index('A')
df1

      B    C  D
A
CAT  60  903  3
BAT  37  742  1
RAT  88  880  7
DOG  86  247  6
COW  25  180  3

In [118]:
df1.reset_index(inplace=True)

In [119]:
df1

     A   B    C  D
0  CAT  60  903  3
1  BAT  37  742  1
2  RAT  88  880  7
3  DOG  86  247  6
4  COW  25  180  3

In [120]:
# df1 = df1.rename(columns = {'A':'ANIMAL','B':'SPEED','C':'WEIGHT','D':'COUNT'})
df1.columns = ['ANIMAL','SPEED','WEIGHT','COUNT']
df1

  ANIMAL  SPEED  WEIGHT  COUNT
0    CAT     60     903      3
1    BAT     37     742      1
2    RAT     88     880      7
3    DOG     86     247      6
4    COW     25     180      3

In [121]:
df1 = df1.set_index('ANIMAL')
df1

        SPEED  WEIGHT  COUNT
ANIMAL
CAT        60     903      3
BAT        37     742      1
RAT        88     880      7
DOG        86     247      6
COW        25     180      3

In [122]:
df2 = df1.iloc[:2,:2].copy()
df2

        SPEED  WEIGHT
ANIMAL
CAT        60     903
BAT        37     742

In [123]:
df2['FRIENDS'] = ['HIPPO','GIRAFFE']
df2

        SPEED  WEIGHT  FRIENDS
ANIMAL
CAT        60     903    HIPPO
BAT        37     742  GIRAFFE

In [124]:
# df1['ALSO FRIENDS'] = df1.apply(lambda x: df2.loc[x['ANIMAL']==df1['ANIMAL'], x['FRIENDS']].reset_index(drop=True), axis=1)
# df1['ALSO FRIENDS'] = df2['FRIENDS'].apply(lambda x: x.index == df2.index)
type(df1)

pandas.core.frame.DataFrame

In [125]:
df3 = pd.merge(df1, df2, on='ANIMAL', how='right')
df3

        SPEED_x  WEIGHT_x  COUNT  SPEED_y  WEIGHT_y  FRIENDS
ANIMAL
CAT          60       903      3       60       903    HIPPO
BAT          37       742      1       37       742  GIRAFFE